all-content.org
#+TITLE: bosabosa
#+STARTUP: logdone
#+HUGO_BASE_DIR: ./

** DONE Make a Website
CLOSED: [2018-10-18 Thu 19:46]
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-10-18 Thu 19:46] \\
  It's up, so this is not TODO. Although it can be better :)
:END:
:PROPERTIES:
#+HUGO_AUTO_SET_LASTMOD: t
:EXPORT_FILE_NAME: make-a-website
:END:
#+begin_details
#+begin_summary
In this post, you will learn what powers this website and how you can create your own in a few minutes.
#+end_summary
I built this website with hugo, a static site generator. The contents are kept in a single file.
#+end_details

*** Overview
 This is the overview of how my site works.

# Insert diagram here.

*** Browse Source

The source code to this site is open and available on [[https://github.com/dds/www.bosabosa.org][github]].

