content/posts/make-a-website.md
+++
title = "Make a Website"
author = ["David Smith"]
lastmod = 2018-10-18T19:40:56-07:00
draft = true
+++

<details>
<summary>
In this post, you will learn what powers this website and how you can create your own in a few minutes.
</summary>
<p class="details">

I built this website with hugo, a static site generator. The contents are kept in a single file.
</p>
</details>


## Overview {#overview}

This is the overview of how my site works.


## Browse Source {#browse-source}

The source code to this site is open and available on [github](https://github.com/dds/www.bosabosa.org).
